Wireless-TAG-Maker/WT_BSP/examples/wt_factory/wt9932s31-tiny/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_WT_BSP_ENABLE_RGB=y
CONFIG_WT_BSP_ENABLE_BUTTON=y
CONFIG_WT_BSP_ENABLE_SDMMC=y
CONFIG_WT_BSP_ENABLE_CAMERA=y
CONFIG_WT_BSP_ENABLE_USB_DEVICE_UVC=y
CONFIG_WT_BSP_USB_DEVICE_COMPOSITE=y
CONFIG_WT_BSP_ENABLE_USB_DEVICE_CDC=y

# Select the fitted sensor in menuconfig. Board Kconfig derives its USB profile.
CONFIG_WT_BSP_S31_CAMERA_SENSOR_GC2145=y
CONFIG_CAMERA_GC2145_DVP_DEFAULT_FMT_RGB565_BE_1600X1200_13FPS=y
CONFIG_CAMERA_XCLK_USE_LEDC=y
# CONFIG_CAMERA_GC2145_AUTO_DETECT_DVP_INTERFACE_SENSOR is not set
# CONFIG_CAMERA_OV3660_AUTO_DETECT_DVP_INTERFACE_SENSOR is not set
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_ENC_VIDEO_DEVICE=y
CONFIG_WT_BSP_S31_JPEG_ENCODE_TIMEOUT_MS=200

# Distinct PID avoids caching the earlier UVC-only interface layout on a host.
CONFIG_TUSB_VID=0x303A
CONFIG_TUSB_PID=0x8001
CONFIG_TUSB_MANUFACTURER="Wireless-Tag"
CONFIG_TUSB_PRODUCT="Wireless-Tag Factory"
CONFIG_TUSB_SERIAL_NUM="ESP32S31-FACTORY"
CONFIG_TINYUSB_RHPORT_HS=y
CONFIG_FORMAT_MJPEG_CAM1=y
CONFIG_UVC_MODE_BULK_CAM1=y
# CONFIG_UVC_CAM1_MULTI_FRAMESIZE is not set
# CONFIG_UVC_SUPPORT_TWO_CAM is not set

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
# CONFIG_WT_FACTORY_ENABLE_SD_RECORDING is not set
